<script setup>
import Illustration from "@/components/Legend/Illustration.vue";

const legends = [  {
  id: 1,
  picture:'https://get.wallhere.com/photo/landscape-forest-fantasy-art-anime-anime-girls-jungle-swamp-wetland-screenshot-woodland-habitat-natural-environment-ecosystem-59878.jpg'
},]

const like =()=>{
  alert('нравится')
  //send request to API
}

</script>

<template>
  <main>
    <div class="container-main" v-for="legend in legends" :key="legend.id">
      <Illustration :legend="legend"/>
      <section class="list-legend-sel">
        <div class="text-legend">
          <p>
            Была у великой богини плодородия Деметры юная дочь Персефона. Однажды прекрасная Персефона вместе со своими подругами, океанидами (дочерьми Океана и Тефиды), беззаботно резвилась в цветущей Ниссейской долине, на берегу Саронического залива, не ведая, что её отец - великий громовержец Зевс - решил отдать её в жёны своему мрачному брату Аиду, властителю подземного царства.
          </p>
          <p>
            Аид, увидев цветущую красоту Персефоны, решил немедля похитить её. С этой целью он упросил богиню Земли Гею вырастить цветок необычайной красоты. Богиня согласилась, и в Ниссейской долине не замедлил вырасти дивный цветок, пьянящий аромат которого разливался далеко вокруг него. Персефона, увидев цветок, протянула к нему руку, но стоило ей только сорвать его, как тут же разверзлась земля: на чёрных конях в золотой колеснице появился из-под земли владыка царства теней Аид, который схватил юную, ничего не подозревающую Персефону, и в мгновение ока скрылся с ней на своих быстрых конях в недрах земли. Персефона от ужаса успела только лишь вскрикнуть… Однако, кроме Гелиоса, бога Солнца, никто не видел, как мрачный Аид похитил Персефону.
          </p>
          <p>
            Богиня Деметра, услышав крик дочери, поспешила в Ниссейскую долину, но тщетно: Персефоны уже нигде не было. Тяжкая скорбь об утрате единственной дочери овладела сердцем матери. Одетая в тёмные одежды, девять дней, ничего не сознавая, блуждала она по земле, проливая горькие слёзы. Никто не мог помочь ей в её горе... На десятый день она пришла к богу Гелиосу, со слезами на глазах умоляя его сказать, где находится её дочь.
          </p>
          <p>
            - Великая богиня, ты знаешь, как я чту тебя… Знай, могущественный Зевс отдал дочь твою в жёны владыке царства теней, - ответил ей Гелиос.-  Побори же свою тяжёлую печаль, богиня; ведь велик муж твоей дочери….

            Ещё больше опечалилась богиня Деметра. Разгневавшись на Зевса, она покинула богов и  светлый Олимп. Приняв вид простой смертной и облекшись в тёмные одежды, долго блуждала богиня между смертными, не переставая проливать горькие слёзы. Без её благотворной силы всякий рост на земле прекратился: листья на деревьях завяли и облетели; сады не давали плодов, засохли зелёные виноградники, а прежде плодородные нивы опустели… Голод царил повсюду: везде слышался плач и стоны…
          </p>
          <p>
            Наконец Деметра пришла к городу Элевсина. У городских стен она присела в тени оливкового дерева на «камень скорби» у самого «колодца дев». Увидели её дочери царя Элевсины - Келея - и привели Деметру к своей матери, Метанейре. Как только коснулась богиня головой косяка двери, весь дом буквально озарился дивным светом: Метанейра  сразу поняла, что дочери привели в дом не простую смертную…
          </p>
          <p>
            Деметра осталась у Келея. В скором времени она повелела выстроить храм в Элевсине, у источника Каллихоры, оставшись там жить. При этом храме Деметра сама учредила празднества.
          </p>
          <p>
            Однако печаль по нежно любимой дочери не покидала её. По-прежнему бесплодна была земля, и голод становился все сильнее и сильнее… Гибель грозила всему живому… Тогда тучегонитель Зевс послал к Деметре вестницу богов - богиню радуги Ириду, которая прилетела на своих радужных крыльях в Элевсинский храм Деметры, моля её вернуться на светлый Олимп. Деметра ни в какую не внимала ее просьбам. Послал тогда к своему мрачному брату Аиду великий Зевс быстрого, как мысль, Гермеса. Аид согласился отпустить Персефону к матери, но предварительно дал ей проглотить зерно граната - символ брака. Взошла Персефона на золотую колесницу мужа вместе с Гермесом, и в мгновение ока достигли они Элевсины.
          </p>
          <p>
            Забыв всё от радости, Деметра бросилась навстречу своей дочери, заключив её в свои объятия, и вместе с ней вернулась на Олимп. Тогда великий Зевс решил, что две трети года Персефона будет жить с матерью, а на одну треть - в царстве своего мужа Аида: вот почему Персефона является не только богиней плодородия, но и богиней мертвых.
          </p>
          <p>
            Как только Деметра нашла свою возлюбленную дочь, великая богиня вернула земле плодородие: снова нежной весенней листвой покрылись леса; запестрели цветы на изумрудных лугах, а вскоре пробудилась и вся природа!
          </p>
          <p>
            Но каждый год покидает свою мать Персефона, и каждый раз Деметра погружается в печаль, вновь облекаясь в тёмные одежды. Тогда вся природа горюет об ушедшей под землю Персефоне: желтеют на деревьях листья осенью, отцветают цветы, пустеют нивы и наступает зима... Природа засыпает на некоторое время, чтобы вновь проснуться в радостном блеске весны - тогда, когда вернётся к своей матери из безрадостного царства Аида прекрасная Персефона. Тогда великая богиня плодородия со всей своей радостью щедро осыпает людей своими дарами, благословляя труд земледельцев богатым урожаем!
          </p>
        </div>

        <ul>
          <li class="cart">
            <div class="product-item-but">
              <button class="but-myth" @click="like">
                нравится
              </button>
            </div>
          </li>
        </ul>
      </section>
    </div>
  </main>
</template>

<style scoped>

</style>